// Safe Links Click Events Telemetry for Teams
// Confirm Safe Links outcomes and adoption in Teams
// Source: https://techcommunity.microsoft.com/blog/microsoftdefenderforoffice365blog/safeguarding-microsoft-teams-with-microsoft-defender-for-office-365/4464086
let lookback = 24h;
UrlClickEvents
| where Timestamp > ago(lookback) and Workload == "Teams"
| summarize Clicks=count(), Users=dcount(AccountUpn) by ActionType
| order by Clicks desc
